## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault_key.sops will be created
  + resource "azurerm_key_vault_key" "sops" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
        ]
      + key_type                = "RSA"
      + key_vault_id            = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.KeyVault/vaults/equalvote"
      + n                       = (known after apply)
      + name                    = "sops"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)

      + rotation_policy {
          + expire_after         = "P90D"
          + notify_before_expiry = "P29D"

          + automatic {
              + time_before_expiry = "P30D"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>